stevennolte/Module_Firmware/ESP32_Product_Controller/src/main.cpp
#include <Arduino.h>
#include <Arduino.h>
#include "ESPconfig.h"
#include "ESPWifi.h"
#include "myLED.h"
#include "Wire.h"
#include <ESPAsyncWebServer.h>
#include "ESP32OTAPull.h"
#include "ESPudp.h"
#include "ArduinoJson.h"
#include "Product_Ctrl.h"
#include "driver/temp_sensor.h"
#include "CANBUS.h"
#include <Adafruit_ADS1X15.h>



// TwoWire twoWire = TwoWire(0);
// TwoWire twoWire1 = TwoWire(0);

// Variables to store the state of the switches
bool foldOuterWingsState = true;
bool foldCenterWingsState = false;
bool raiseWingsState = false;



ESPconfig espConfig;
Adafruit_ADS1015 ads;
CANBUS canbus(&espConfig);
MyLED myLED(&espConfig);
ESPWifi espWifi(&espConfig);
ESPudp espUdp(&espConfig);
Product_Ctrl productCtrl(&espConfig, &canbus, &ads);
std::vector<String> debugVars;

AsyncEventSource events("/events");
AsyncWebServer server(80);

auto& progData = espConfig.progData;
auto& progCfg = espConfig.progCfg;
auto& progState = espConfig.progData.state;
auto& wifiCfg = espConfig.wifiCfg;



void IRAM_ATTR ISR()
{
  espConfig.rateData.pulseCount++;
}

#pragma region Webserver

void sendServerData() {
  // Send the server data to the client
  StaticJsonDocument<256> doc;
        doc["name"] = NAME;
        doc["version"] = VERSION;
        doc["timestamp"] = millis()/1000;
        doc["actPressure"] = espConfig.rateData.actualPressure;
        doc["tarPressure"] = espConfig.rateData.targetPressure;
        doc["actFlowRate"] = espConfig.rateData.actualFlowRate;
        doc["tarFlowRate"] = espConfig.rateData.targetFlowRate;
        doc["actApplicationRate"] = espConfig.rateData.targetRate;
        doc["tarApplicationRate"] = espConfig.rateData.actualRate;
        doc["actRegulatorPosition"] = float(espConfig.regData.regReport.regReport_Struct.position)/100.0;
        doc["tarRegulatorPosition"] = espConfig.regData.targetPosition;
        doc["regulatorState"] = espConfig.regData.state;
        // Serialize the JSON object to a string
        String jsonMessage;
        serializeJson(doc, jsonMessage);

        // Send the JSON string as an SSE message
        // Serial.println("Sent data");
        events.send(jsonMessage.c_str(), "moduleData", millis());
}

void handleFirmwareUpload(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {
  if (!index) {
    Serial.printf("Update Start: %s\n", filename.c_str());
    if (!Update.begin(UPDATE_SIZE_UNKNOWN)) { // Start with max available size
      Update.printError(Serial);
    }
  }
  
  // Write the received data to the flash memory
  if (Update.write(data, len) != len) {
    Update.printError(Serial);
  }

  // If the upload is complete
  if (final) {
    if (Update.end(true)) { // True to set the size correctly
      Serial.printf("Update Success: %u bytes\n", index + len);
      request->send(200, "text/html", "Update complete! Rebooting...");
      delay(1000);
      ESP.restart();
    } else {
      Update.printError(Serial);
      request->send(500, "text/html", "Update failed.");
    }
  }
}


void updateDebugVars() {
  debugVars.clear(); // Clear the list to update it dynamically
  debugVars.push_back("Program: " + String(NAME));
  debugVars.push_back("Timestamp since boot [s]: " + String((float)(millis())/1000.0));
  debugVars.push_back("Free Heap: " + String(ESP.getFreeHeap()) + " bytes");
  float tempReading;
  temp_sensor_read_celsius(&tempReading);
  debugVars.push_back("Temp: " + String(tempReading));
  debugVars.push_back("Version: " + String(VERSION));
  debugVars.push_back("Wifi SSID: " + WiFi.SSID());
  debugVars.push_back("IP Address: " + String(wifiCfg.ips[0])+"."+String(wifiCfg.ips[1])+"."+String(wifiCfg.ips[2])+"."+String(wifiCfg.ips[3]));
  debugVars.push_back("Wifi State: " + String(wifiCfg.state));
  debugVars.push_back("Program State: " + String(progData.state));
  debugVars.push_back("TargetRate: " + String(espConfig.rateData.targetRate));
  debugVars.push_back("Flow Rate: " + String(espConfig.flowCfg.flowRate));
  debugVars.push_back("Fold Outer Wings: " + String(foldOuterWingsState ? "ON" : "OFF"));
  debugVars.push_back("Sec 1: " + String(espConfig.rateData.sectionStates[0]));
  debugVars.push_back("Sec 2: " + String(espConfig.rateData.sectionStates[1]));
  debugVars.push_back("Sec 3: " + String(espConfig.rateData.sectionStates[2]));
  debugVars.push_back("Sec 4: " + String(espConfig.rateData.sectionStates[3]));
  debugVars.push_back("Sec 5: " + String(espConfig.rateData.sectionStates[4]));
  debugVars.push_back("Flow Freq: " + String(espConfig.rateData.frequency));
  debugVars.push_back("Target Pressure: " + String(espConfig.rateData.targetPressure));
  debugVars.push_back("Target Flow Rate: " + String(espConfig.rateData.targetFlowRate));
  debugVars.push_back("Actual Flow Rate: " + String(espConfig.rateData.actualFlowRate));
  debugVars.push_back("Pulse Count: " + String(espConfig.rateData.pulseCount));
  debugVars.push_back("Target Row Flow Rate: " + String(espConfig.rateData.targetRowFlowRate));
  debugVars.push_back("Speed: " + String(espConfig.rateData.speed));
  debugVars.push_back("Last Section Msg: " + String(espConfig.rateData.lastSectionMsg));
  debugVars.push_back("Regulator Info:");
  debugVars.push_back("Regulator State: " + String(espConfig.regData.state));
  debugVars.push_back("Regulator ID: " + String(espConfig.regData.regID.regID_Struct.id));
  debugVars.push_back("Regulator Position: " + String(espConfig.regData.regReport.regReport_Struct.position));
  debugVars.push_back("Regulator Target Position: " + String(espConfig.regData.targetPosition));  
  debugVars.push_back("Regulator Speed: " + String(espConfig.regData.speed));
  

  String sipValue = String(wifiCfg.ips[0])+"."+String(wifiCfg.ips[1])+"."+String(wifiCfg.ips[2])+"."+String(wifiCfg.ips[3]);
  int   ArrayLength  =sipValue.length()+1;    //The +1 is for the 0x00h Terminator
  char  CharArray[ArrayLength];
  sipValue.toCharArray(CharArray,ArrayLength);
  // std::string ipValue = sipValue.toCharArray();
  
